koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.c
/* USART2 */
#ifdef USE_USART2

/* USART2 Run-Time Information */
static USART_INFO            USART2_Info         = {0};
static USART_TRANSFER_INFO   USART2_TransferInfo = {0};
static const USART_RESOURCES USART2_Resources;

#ifdef USART2_TX_DMA_Stream
static DMA_Handle_t USART2_TX_DMA_Handle;
static const DMA_Resources_t USART2_TX_DMA = {
  &USART2_TX_DMA_Handle,
  USART2_TX_DMA_Stream,
  USART2_TX_DMA_Channel,
  USART2_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &USART2_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  USART2_TX_DMA_IRQn,
};
#endif

#ifdef USART2_RX_DMA_Stream
static DMA_Handle_t USART2_RX_DMA_Handle;
static const DMA_Resources_t USART2_RX_DMA = {
  &USART2_RX_DMA_Handle,
  USART2_RX_DMA_Stream,
  USART2_RX_DMA_Channel,
  USART2_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &USART2_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  USART2_RX_DMA_IRQn,
};
#endif

#ifdef USE_USART2_TX_Pin
static USART_PIN USART2_tx = {
    USART2_TX_GPIO_PORT,
    USART2_TX_GPIO_PIN,
    USART2_TX_GPIO_FUNC
};
#endif

#ifdef USE_USART2_RX_Pin
static USART_PIN USART2_rx = {
    USART2_RX_GPIO_PORT,
    USART2_RX_GPIO_PIN,
    USART2_RX_GPIO_FUNC
};
#endif

#ifdef USE_USART2_CK_Pin
static USART_PIN USART2_ck = {
    USART2_CK_GPIO_PORT,
    USART2_CK_GPIO_PIN,
    USART2_CK_GPIO_FUNC
};
#endif

#ifdef USE_USART2_RTS_Pin
static USART_PIN USART2_rts = {
    USART2_RTS_GPIO_PORT,
    USART2_RTS_GPIO_PIN,
    USART2_RTS_GPIO_FUNC
};
#endif

#ifdef USE_USART2_CTS_Pin
static USART_PIN USART2_cts = {
    USART2_CTS_GPIO_PORT,
    USART2_CTS_GPIO_PIN,
    USART2_CTS_GPIO_FUNC
};
#endif

/* USART2 Resources */
static const USART_RESOURCES USART2_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef USE_USART2_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_USART2_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_USART2_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_USART2_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_USART2_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_USART2_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  USART2,
  RCC_PERIPH_USART2,
  // PINS
  {
#ifdef USE_USART2_TX_Pin
    &USART2_tx,
#else
    NULL,
#endif
#ifdef USE_USART2_RX_Pin
    &USART2_rx,
#else
    NULL,
#endif
#ifdef USE_USART2_CK_Pin
    &USART2_ck,
#else
    NULL,
#endif
#ifdef USE_USART2_RTS_Pin
    &USART2_rts,
#else
    NULL,
#endif
#ifdef USE_USART2_CTS_Pin
    &USART2_cts,
#else
    NULL,
#endif
  },
  USART2_IRQn,
#ifdef USART2_TX_DMA_Stream
  &USART2_TX_DMA,
#else
  NULL,
#endif
#ifdef USART2_RX_DMA_Stream
  &USART2_RX_DMA,
#else
  NULL,
#endif
  &USART2_Info,
  &USART2_TransferInfo
};
#endif

/* USART3 */
#ifdef USE_USART3

/* USART3 Run-Time Information */
static USART_INFO            USART3_Info         = {0};
static USART_TRANSFER_INFO   USART3_TransferInfo = {0};
static const USART_RESOURCES USART3_Resources;

#ifdef USART3_TX_DMA_Stream
static DMA_Handle_t USART3_TX_DMA_Handle;
static const DMA_Resources_t USART3_TX_DMA = {
  &USART3_TX_DMA_Handle,
  USART3_TX_DMA_Stream,
  USART3_TX_DMA_Channel,
  USART3_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &USART3_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  USART3_TX_DMA_IRQn,
};
#endif

#ifdef USART3_RX_DMA_Stream
static DMA_Handle_t USART3_RX_DMA_Handle;
static const DMA_Resources_t USART3_RX_DMA = {
  &USART3_RX_DMA_Handle,
  USART3_RX_DMA_Stream,
  USART3_RX_DMA_Channel,
  USART3_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &USART3_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  USART3_RX_DMA_IRQn,
};
#endif

#ifdef USE_USART3_TX_Pin
static USART_PIN USART3_tx = {
    USART3_TX_GPIO_PORT,
    USART3_TX_GPIO_PIN,
    USART3_TX_GPIO_FUNC
};
#endif

#ifdef USE_USART3_RX_Pin
static USART_PIN USART3_rx = {
    USART3_RX_GPIO_PORT,
    USART3_RX_GPIO_PIN,
    USART3_RX_GPIO_FUNC
};
#endif

#ifdef USE_USART3_CK_Pin
static USART_PIN USART3_ck = {
    USART3_CK_GPIO_PORT,
    USART3_CK_GPIO_PIN,
    USART3_CK_GPIO_FUNC
};
#endif

#ifdef USE_USART3_RTS_Pin
static USART_PIN USART3_rts = {
    USART3_RTS_GPIO_PORT,
    USART3_RTS_GPIO_PIN,
    USART3_RTS_GPIO_FUNC
};
#endif

#ifdef USE_USART3_CTS_Pin
static USART_PIN USART3_cts = {
    USART3_CTS_GPIO_PORT,
    USART3_CTS_GPIO_PIN,
    USART3_CTS_GPIO_FUNC
};
#endif

/* USART3 Resources */
static const USART_RESOURCES USART3_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef USE_USART3_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_USART3_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_USART3_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_USART3_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_USART3_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_USART3_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  USART3,
  RCC_PERIPH_USART3,
  // PINS
  {
#ifdef USE_USART3_TX_Pin
    &USART3_tx,
#else
    NULL,
#endif
#ifdef USE_USART3_RX_Pin
    &USART3_rx,
#else
    NULL,
#endif
#ifdef USE_USART3_CK_Pin
    &USART3_ck,
#else
    NULL,
#endif
#ifdef USE_USART3_RTS_Pin
    &USART3_rts,
#else
    NULL,
#endif
#ifdef USE_USART3_CTS_Pin
    &USART3_cts,
#else
    NULL,
#endif
  },
  USART3_IRQn,
#ifdef USART3_TX_DMA_Stream
  &USART3_TX_DMA,
#else
  NULL,
#endif
#ifdef USART3_RX_DMA_Stream
  &USART3_RX_DMA,
#else
  NULL,
#endif
  &USART3_Info,
  &USART3_TransferInfo
};
#endif

