koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.c
/* UART4 */
#ifdef USE_UART4

/* UART4 Run-Time Information */
static USART_INFO            UART4_Info         = {0};
static USART_TRANSFER_INFO   UART4_TransferInfo = {0};
static const USART_RESOURCES UART4_Resources;

#ifdef UART4_TX_DMA_Stream
static DMA_Handle_t UART4_TX_DMA_Handle;
static const DMA_Resources_t UART4_TX_DMA = {
  &UART4_TX_DMA_Handle,
  UART4_TX_DMA_Stream,
  UART4_TX_DMA_Channel,
  UART4_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &UART4_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART4_TX_DMA_IRQn,
};
#endif

#ifdef UART4_RX_DMA_Stream
static DMA_Handle_t UART4_RX_DMA_Handle;
static const DMA_Resources_t UART4_RX_DMA = {
  &UART4_RX_DMA_Handle,
  UART4_RX_DMA_Stream,
  UART4_RX_DMA_Channel,
  UART4_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &UART4_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART4_RX_DMA_IRQn,
};
#endif

#ifdef USE_UART4_TX_Pin
static USART_PIN UART4_tx = {
    UART4_TX_GPIO_PORT,
    UART4_TX_GPIO_PIN,
    UART4_TX_GPIO_FUNC
};
#endif

#ifdef USE_UART4_RX_Pin
static USART_PIN UART4_rx = {
    UART4_RX_GPIO_PORT,
    UART4_RX_GPIO_PIN,
    UART4_RX_GPIO_FUNC
};
#endif

#ifdef USE_UART4_CK_Pin
static USART_PIN UART4_ck = {
    UART4_CK_GPIO_PORT,
    UART4_CK_GPIO_PIN,
    UART4_CK_GPIO_FUNC
};
#endif

#ifdef USE_UART4_RTS_Pin
static USART_PIN UART4_rts = {
    UART4_RTS_GPIO_PORT,
    UART4_RTS_GPIO_PIN,
    UART4_RTS_GPIO_FUNC
};
#endif

#ifdef USE_UART4_CTS_Pin
static USART_PIN UART4_cts = {
    UART4_CTS_GPIO_PORT,
    UART4_CTS_GPIO_PIN,
    UART4_CTS_GPIO_FUNC
};
#endif

/* UART4 Resources */
static const USART_RESOURCES UART4_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_UART4_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_UART4_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_UART4_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_UART4_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_UART4_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  UART4,
  RCC_PERIPH_UART4,
  // PINS
  {
#ifdef USE_UART4_TX_Pin
    &UART4_tx,
#else
    NULL,
#endif
#ifdef USE_UART4_RX_Pin
    &UART4_rx,
#else
    NULL,
#endif
#ifdef USE_UART4_CK_Pin
    &UART4_ck,
#else
    NULL,
#endif
#ifdef USE_UART4_RTS_Pin
    &UART4_rts,
#else
    NULL,
#endif
#ifdef USE_UART4_CTS_Pin
    &UART4_cts,
#else
    NULL,
#endif
  },
  UART4_IRQn,
#ifdef UART4_TX_DMA_Stream
  &UART4_TX_DMA,
#else
  NULL,
#endif
#ifdef UART4_RX_DMA_Stream
  &UART4_RX_DMA,
#else
  NULL,
#endif
  &UART4_Info,
  &UART4_TransferInfo
};
#endif

/* UART5 */
#ifdef USE_UART5

/* UART5 Run-Time Information */
static USART_INFO            UART5_Info         = {0};
static USART_TRANSFER_INFO   UART5_TransferInfo = {0};
static const USART_RESOURCES UART5_Resources;

#ifdef UART5_TX_DMA_Stream
static DMA_Handle_t UART5_TX_DMA_Handle;
static const DMA_Resources_t UART5_TX_DMA = {
  &UART5_TX_DMA_Handle,
  UART5_TX_DMA_Stream,
  UART5_TX_DMA_Channel,
  UART5_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &UART5_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART5_TX_DMA_IRQn,
};
#endif

#ifdef UART5_RX_DMA_Stream
static DMA_Handle_t UART5_RX_DMA_Handle;
static const DMA_Resources_t UART5_RX_DMA = {
  &UART5_RX_DMA_Handle,
  UART5_RX_DMA_Stream,
  UART5_RX_DMA_Channel,
  UART5_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &UART5_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART5_RX_DMA_IRQn,
};
#endif

#ifdef USE_UART5_TX_Pin
static USART_PIN UART5_tx = {
    UART5_TX_GPIO_PORT,
    UART5_TX_GPIO_PIN,
    UART5_TX_GPIO_FUNC
};
#endif

#ifdef USE_UART5_RX_Pin
static USART_PIN UART5_rx = {
    UART5_RX_GPIO_PORT,
    UART5_RX_GPIO_PIN,
    UART5_RX_GPIO_FUNC
};
#endif

#ifdef USE_UART5_CK_Pin
static USART_PIN UART5_ck = {
    UART5_CK_GPIO_PORT,
    UART5_CK_GPIO_PIN,
    UART5_CK_GPIO_FUNC
};
#endif

#ifdef USE_UART5_RTS_Pin
static USART_PIN UART5_rts = {
    UART5_RTS_GPIO_PORT,
    UART5_RTS_GPIO_PIN,
    UART5_RTS_GPIO_FUNC
};
#endif

#ifdef USE_UART5_CTS_Pin
static USART_PIN UART5_cts = {
    UART5_CTS_GPIO_PORT,
    UART5_CTS_GPIO_PIN,
    UART5_CTS_GPIO_FUNC
};
#endif

/* UART5 Resources */
static const USART_RESOURCES UART5_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_UART5_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_UART5_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_UART5_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_UART5_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_UART5_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  UART5,
  RCC_PERIPH_UART5,
  // PINS
  {
#ifdef USE_UART5_TX_Pin
    &UART5_tx,
#else
    NULL,
#endif
#ifdef USE_UART5_RX_Pin
    &UART5_rx,
#else
    NULL,
#endif
#ifdef USE_UART5_CK_Pin
    &UART5_ck,
#else
    NULL,
#endif
#ifdef USE_UART5_RTS_Pin
    &UART5_rts,
#else
    NULL,
#endif
#ifdef USE_UART5_CTS_Pin
    &UART5_cts,
#else
    NULL,
#endif
  },
  UART5_IRQn,
#ifdef UART5_TX_DMA_Stream
  &UART5_TX_DMA,
#else
  NULL,
#endif
#ifdef UART5_RX_DMA_Stream
  &UART5_RX_DMA,
#else
  NULL,
#endif
  &UART5_Info,
  &UART5_TransferInfo
};
#endif

/* USART6 */
#ifdef USE_USART6

/* USART6 Run-Time Information */
static USART_INFO            USART6_Info         = {0};
static USART_TRANSFER_INFO   USART6_TransferInfo = {0};
static const USART_RESOURCES USART6_Resources;

#ifdef USART6_TX_DMA_Stream
static DMA_Handle_t USART6_TX_DMA_Handle;
static const DMA_Resources_t USART6_TX_DMA = {
  &USART6_TX_DMA_Handle,
  USART6_TX_DMA_Stream,
  USART6_TX_DMA_Channel,
  USART6_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &USART6_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  USART6_TX_DMA_IRQn,
};
#endif

