koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.c
#ifdef USART6_RX_DMA_Stream
static DMA_Handle_t USART6_RX_DMA_Handle;
static const DMA_Resources_t USART6_RX_DMA = {
  &USART6_RX_DMA_Handle,
  USART6_RX_DMA_Stream,
  USART6_RX_DMA_Channel,
  USART6_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &USART6_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  USART6_RX_DMA_IRQn,
};
#endif

#ifdef USE_USART6_TX_Pin
static USART_PIN USART6_tx = {
    USART6_TX_GPIO_PORT,
    USART6_TX_GPIO_PIN,
    USART6_TX_GPIO_FUNC
};
#endif

#ifdef USE_USART6_RX_Pin
static USART_PIN USART6_rx = {
    USART6_RX_GPIO_PORT,
    USART6_RX_GPIO_PIN,
    USART6_RX_GPIO_FUNC
};
#endif

#ifdef USE_USART6_CK_Pin
static USART_PIN USART6_ck = {
    USART6_CK_GPIO_PORT,
    USART6_CK_GPIO_PIN,
    USART6_CK_GPIO_FUNC
};
#endif

#ifdef USE_USART6_RTS_Pin
static USART_PIN USART6_rts = {
    USART6_RTS_GPIO_PORT,
    USART6_RTS_GPIO_PIN,
    USART6_RTS_GPIO_FUNC
};
#endif

#ifdef USE_USART6_CTS_Pin
static USART_PIN USART6_cts = {
    USART6_CTS_GPIO_PORT,
    USART6_CTS_GPIO_PIN,
    USART6_CTS_GPIO_FUNC
};
#endif

/* USART6 Resources */
static const USART_RESOURCES USART6_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef USE_USART6_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_USART6_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_USART6_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_USART6_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_USART6_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_USART6_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  USART6,
  RCC_PERIPH_USART6,
  // PINS
  {
#ifdef USE_USART6_TX_Pin
    &USART6_tx,
#else
    NULL,
#endif
#ifdef USE_USART6_RX_Pin
    &USART6_rx,
#else
    NULL,
#endif
#ifdef USE_USART6_CK_Pin
    &USART6_ck,
#else
    NULL,
#endif
#ifdef USE_USART6_RTS_Pin
    &USART6_rts,
#else
    NULL,
#endif
#ifdef USE_USART6_CTS_Pin
    &USART6_cts,
#else
    NULL,
#endif
  },
  USART6_IRQn,
#ifdef USART6_TX_DMA_Stream
  &USART6_TX_DMA,
#else
  NULL,
#endif
#ifdef USART6_RX_DMA_Stream
  &USART6_RX_DMA,
#else
  NULL,
#endif
  &USART6_Info,
  &USART6_TransferInfo
};
#endif

/* UART7 */
#ifdef USE_UART7

/* UART7 Run-Time Information */
static USART_INFO            UART7_Info         = {0};
static USART_TRANSFER_INFO   UART7_TransferInfo = {0};
static const USART_RESOURCES UART7_Resources;

#ifdef UART7_TX_DMA_Stream
static DMA_Handle_t UART7_TX_DMA_Handle;
static const DMA_Resources_t UART7_TX_DMA = {
  &UART7_TX_DMA_Handle,
  UART7_TX_DMA_Stream,
  UART7_TX_DMA_Channel,
  UART7_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &UART7_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART7_TX_DMA_IRQn,
};
#endif

#ifdef UART7_RX_DMA_Stream
static DMA_Handle_t UART7_RX_DMA_Handle;
static const DMA_Resources_t UART7_RX_DMA = {
  &UART7_RX_DMA_Handle,
  UART7_RX_DMA_Stream,
  UART7_RX_DMA_Channel,
  UART7_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &UART7_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART7_RX_DMA_IRQn,
};
#endif

#ifdef USE_UART7_TX_Pin
static USART_PIN UART7_tx = {
    UART7_TX_GPIO_PORT,
    UART7_TX_GPIO_PIN,
    UART7_TX_GPIO_FUNC
};
#endif

#ifdef USE_UART7_RX_Pin
static USART_PIN UART7_rx = {
    UART7_RX_GPIO_PORT,
    UART7_RX_GPIO_PIN,
    UART7_RX_GPIO_FUNC
};
#endif

#ifdef USE_UART7_CK_Pin
static USART_PIN UART7_ck = {
    UART7_CK_GPIO_PORT,
    UART7_CK_GPIO_PIN,
    UART7_CK_GPIO_FUNC
};
#endif

#ifdef USE_UART7_RTS_Pin
static USART_PIN UART7_rts = {
    UART7_RTS_GPIO_PORT,
    UART7_RTS_GPIO_PIN,
    UART7_RTS_GPIO_FUNC
};
#endif

#ifdef USE_UART7_CTS_Pin
static USART_PIN UART7_cts = {
    UART7_CTS_GPIO_PORT,
    UART7_CTS_GPIO_PIN,
    UART7_CTS_GPIO_FUNC
};
#endif

/* UART7 Resources */
static const USART_RESOURCES UART7_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_UART7_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_UART7_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_UART7_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_UART7_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_UART7_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  UART7,
  RCC_PERIPH_UART7,
  // PINS
  {
#ifdef USE_UART7_TX_Pin
    &UART7_tx,
#else
    NULL,
#endif
#ifdef USE_UART7_RX_Pin
    &UART7_rx,
#else
    NULL,
#endif
#ifdef USE_UART7_CK_Pin
    &UART7_ck,
#else
    NULL,
#endif
#ifdef USE_UART7_RTS_Pin
    &UART7_rts,
#else
    NULL,
#endif
#ifdef USE_UART7_CTS_Pin
    &UART7_cts,
#else
    NULL,
#endif
  },
  UART7_IRQn,
#ifdef UART7_TX_DMA_Stream
  &UART7_TX_DMA,
#else
  NULL,
#endif
#ifdef UART7_RX_DMA_Stream
  &UART7_RX_DMA,
#else
  NULL,
#endif
  &UART7_Info,
  &UART7_TransferInfo
};
#endif

