koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.c
/* UART8 */
#ifdef USE_UART8

/* UART8 Run-Time Information */
static USART_INFO            UART8_Info         = {0};
static USART_TRANSFER_INFO   UART8_TransferInfo = {0};
static const USART_RESOURCES UART8_Resources;

#ifdef UART8_TX_DMA_Stream
static DMA_Handle_t UART8_TX_DMA_Handle;
static const DMA_Resources_t UART8_TX_DMA = {
  &UART8_TX_DMA_Handle,
  UART8_TX_DMA_Stream,
  UART8_TX_DMA_Channel,
  UART8_TX_DMA_Priority,
  USART_TX_DMA_Callback,
  &UART8_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART8_TX_DMA_IRQn,
};
#endif

#ifdef UART8_RX_DMA_Stream
static DMA_Handle_t UART8_RX_DMA_Handle;
static const DMA_Resources_t UART8_RX_DMA = {
  &UART8_RX_DMA_Handle,
  UART8_RX_DMA_Stream,
  UART8_RX_DMA_Channel,
  UART8_RX_DMA_Priority,
  USART_RX_DMA_Callback,
  &UART8_Resources,
  DEV_USART_DMA_INT_PRIORITY,
  UART8_RX_DMA_IRQn,
};
#endif

#ifdef USE_UART8_TX_Pin
static USART_PIN UART8_tx = {
    UART8_TX_GPIO_PORT,
    UART8_TX_GPIO_PIN,
    UART8_TX_GPIO_FUNC
};
#endif

#ifdef USE_UART8_RX_Pin
static USART_PIN UART8_rx = {
    UART8_RX_GPIO_PORT,
    UART8_RX_GPIO_PIN,
    UART8_RX_GPIO_FUNC
};
#endif

#ifdef USE_UART8_CK_Pin
static USART_PIN UART8_ck = {
    UART8_CK_GPIO_PORT,
    UART8_CK_GPIO_PIN,
    UART8_CK_GPIO_FUNC
};
#endif

#ifdef USE_UART8_RTS_Pin
static USART_PIN UART8_rts = {
    UART8_RTS_GPIO_PORT,
    UART8_RTS_GPIO_PIN,
    UART8_RTS_GPIO_FUNC
};
#endif

#ifdef USE_UART8_CTS_Pin
static USART_PIN UART8_cts = {
    UART8_CTS_GPIO_PORT,
    UART8_CTS_GPIO_PIN,
    UART8_CTS_GPIO_FUNC
};
#endif

/* UART8 Resources */
static const USART_RESOURCES UART8_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef USE_UART8_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef USE_UART8_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
#ifdef USE_UART8_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef USE_UART8_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef USE_UART8_CTS_Pin
    1,  // Signal CTS change event: \ref USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  UART8,
  RCC_PERIPH_UART8,
  // PINS
  {
#ifdef USE_UART8_TX_Pin
    &UART8_tx,
#else
    NULL,
#endif
#ifdef USE_UART8_RX_Pin
    &UART8_rx,
#else
    NULL,
#endif
#ifdef USE_UART8_CK_Pin
    &UART8_ck,
#else
    NULL,
#endif
#ifdef USE_UART8_RTS_Pin
    &UART8_rts,
#else
    NULL,
#endif
#ifdef USE_UART8_CTS_Pin
    &UART8_cts,
#else
    NULL,
#endif
  },
  UART8_IRQn,
#ifdef UART8_TX_DMA_Stream
  &UART8_TX_DMA,
#else
  NULL,
#endif
#ifdef UART8_RX_DMA_Stream
  &UART8_RX_DMA,
#else
  NULL,
#endif
  &UART8_Info,
  &UART8_TransferInfo
};
#endif

/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

/**
 * @fn          void PinConfig(const USART_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
 * @brief       Configure Pin
 * @param[in]   io       Pointer to USART_PIN
 * @param[in]   pin_cfg  Pointer to GPIO_PIN_CFG_t
 */
static
void PinConfig(const USART_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
{
  if ((io == NULL) || (pin_cfg == NULL)) {
    return;
  }

  if (GPIO_GetPortClockState(io->port) == GPIO_PORT_CLK_DISABLE) {
    GPIO_PortClock(io->port, GPIO_PORT_CLK_ENABLE);
  }

  if (pin_cfg->mode == GPIO_MODE_AF_PP || pin_cfg->mode == GPIO_MODE_AF_OD) {
    GPIO_AFConfig(io->port, io->pin, io->func);
  }

  GPIO_PinConfig(io->port, io->pin, pin_cfg);
}

/**
 * @fn          DRIVER_VERSION USARTx_GetVersion(void)
 * @brief       Get driver version.
 * @return      \ref DRIVER_VERSION
 */
static DRIVER_VERSION USARTx_GetVersion(void)
{
  return (usart_driver_version);
}

/**
 * @fn          USART_CAPABILITIES USART_GetCapabilities(const USART_RESOURCES *usart)
 * @brief       Get driver capabilities
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref USART_CAPABILITIES
 */
static USART_CAPABILITIES USART_GetCapabilities(const USART_RESOURCES *usart)
{
  return (usart->capabilities);
}

/**
 * @fn          int32_t USART_Initialize(USART_SignalEvent_t cb_event, const USART_RESOURCES *usart)
 * @brief       Initialize USART Interface.
 * @param[in]   cb_event  Pointer to \ref USART_SignalEvent
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Initialize(USART_SignalEvent_t cb_event, const USART_RESOURCES *usart)
{
  USART_INFO          *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if (info->flags & USART_FLAG_INITIALIZED) {
    /* Driver is already initialized */
    return (DRIVER_OK);
  }

  /* Initialize USART Run-time Resources */
  info->cb_event                = cb_event;

  info->status.tx_busy          = 0U;
  info->status.rx_busy          = 0U;
  info->status.tx_underflow     = 0U;
  info->status.rx_overflow      = 0U;
  info->status.rx_break         = 0U;
  info->status.rx_framing_error = 0U;
  info->status.rx_parity_error  = 0U;

