koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.c
  /* USART Parity */
  switch (control & USART_PARITY_Msk) {
    case USART_PARITY_NONE:
      break;
    case USART_PARITY_EVEN:
      cr1 |= USART_CR1_PCE;
      break;
    case USART_PARITY_ODD:
      cr1 |= (USART_CR1_PCE | USART_CR1_PS);
      break;
    default:
      return USART_ERROR_PARITY;
  }

  /* USART Stop bits */
  switch (control & USART_STOP_BITS_Msk) {
    case USART_STOP_BITS_1:
      break;
    case USART_STOP_BITS_2:
      cr2 |= USART_CR2_STOP_1;
      break;
    case USART_STOP_BITS_1_5:
      cr2 |= USART_CR2_STOP_0 | USART_CR2_STOP_1;
      break;
    case USART_STOP_BITS_0_5:
      cr2 |= USART_CR2_STOP_0;
      break;
    default:
      return USART_ERROR_STOP_BITS;
  }

  /* USART Flow control */
  switch (control & USART_FLOW_CONTROL_Msk) {
    case USART_FLOW_CONTROL_NONE:
      flow_control = USART_FLOW_CONTROL_NONE;
      break;

    case USART_FLOW_CONTROL_RTS:
      if (usart->capabilities.flow_control_rts) {
        flow_control = USART_FLOW_CONTROL_RTS;
        /* RTS Enable */
        cr3 |= USART_CR3_RTSE;
      }
      else {
        return (USART_ERROR_FLOW_CONTROL);
      }
      break;

    case USART_FLOW_CONTROL_CTS:
      if (usart->capabilities.flow_control_cts) {
        flow_control = USART_FLOW_CONTROL_CTS;
        /* CTS Enable, CTS interrupt enable */
        cr3 |= USART_CR3_CTSE | USART_CR3_CTSIE;
      }
      else {
        return (USART_ERROR_FLOW_CONTROL);
      }
      break;

    case USART_FLOW_CONTROL_RTS_CTS:
      if ((usart->capabilities.flow_control_rts != 0U) && (usart->capabilities.flow_control_cts != 0U)) {
        flow_control = USART_FLOW_CONTROL_RTS_CTS;
        /* RTS and CTS Enable, CTS interrupt enable */
        cr3 |= (USART_CR3_RTSE | USART_CR3_CTSE | USART_CR3_CTSIE);
      }
      else {
        return (USART_ERROR_FLOW_CONTROL);
      }
      break;

    default:
      return USART_ERROR_FLOW_CONTROL;
  }

  /* Clock setting for synchronous mode */
  if (mode == USART_MODE_SYNCHRONOUS_MASTER) {
    /* Polarity */
    switch (control & USART_CPOL_Msk) {
      case USART_CPOL0:
        break;
      case USART_CPOL1:
        cr2 |= USART_CR2_CPOL;
        break;
      default:
        return USART_ERROR_CPOL;
    }

    /* Phase */
    switch (control & USART_CPHA_Msk) {
      case USART_CPHA0:
        break;
      case USART_CPHA1:
        cr2 |= USART_CR2_CPHA;
        break;
      default:
        return USART_ERROR_CPHA;
    }
  }

  /* USART Baudrate */
  val = RCC_GetPeriphFreq(usart->periph);
  uint32_t usart_div = (uint32_t)USART_BAUDRATE_DIVIDER(val, arg);

  uint32_t baudrate  = (val / (usart_div & 0xFFFFU));
  /* If inside +/- 2% tolerance, baud rate configured correctly */
  if (!(((baudrate * 100U) < (arg * 102U)) && ((baudrate * 100U) > (arg * 98U)))) {
    return (USART_ERROR_BAUDRATE);
  }

  /* USART Disable */
  reg->CR1 &= ~USART_CR1_UE;

  /* Configure Baud rate register */
  reg->BRR = usart_div;

  /* Configuration is OK - Mode is valid */
  info->mode = mode;

  /* Save flow control mode */
  info->flow_control = flow_control;

  /* Configure TX pin regarding mode and transmitter state */
  switch (info->mode) {
    case USART_MODE_SMART_CARD:
      /* USART TX pin function selected */
      PinConfig(usart->io.tx, &USART_pin_cfg_af);
      break;

    default:
      /* Synchronous master/slave, asynchronous, single-wire and IrDA mode */
      if (info->flags & USART_FLAG_TX_ENABLED) {
        /* USART TX pin function selected */
        PinConfig(usart->io.tx, &USART_pin_cfg_af);
      }
      else {
        /* GPIO pin function selected */
        PinConfig(usart->io.tx, &USART_pin_cfg_input);
      }
      break;
  }

  /* Configure RX pin regarding mode and receiver state */
  switch (info->mode) {
    case USART_MODE_SINGLE_WIRE:
    case USART_MODE_SMART_CARD:
      /* GPIO pin function selected */
      PinConfig(usart->io.rx, &USART_pin_cfg_input);
      break;

    default:
      /* Synchronous master/slave, asynchronous */
      if (info->flags & USART_FLAG_RX_ENABLED) {
        /* USART RX pin function selected */
        PinConfig(usart->io.rx, &USART_pin_cfg_af);
      }
      else {
        /* GPIO pin function selected */
        PinConfig(usart->io.rx, &USART_pin_cfg_input);
      }
      break;
  }

  /* Configure CLK pin regarding mode */
  if (usart->io.ck) {
    switch (info->mode) {
      case USART_MODE_SMART_CARD:
      case USART_MODE_SYNCHRONOUS_MASTER:
        /* USART CK pin function selected */
        PinConfig(usart->io.ck, &USART_pin_cfg_af);
        break;

      default:
        /* Asynchronous, Single-wire
           GPIO pin function selected */
        PinConfig(usart->io.ck, &USART_pin_cfg_input);
        break;
    }
  }

  /* Configure RTS pin regarding Flow control configuration */
  if (usart->io.rts) {
    if ((flow_control == USART_FLOW_CONTROL_RTS) || (flow_control == USART_FLOW_CONTROL_RTS_CTS)) {
      /* USART RTS Alternate function */
      PinConfig(usart->io.rts, &USART_pin_cfg_af);
    }
    else {
      /* GPIO output */
      PinConfig(usart->io.rts, &USART_pin_cfg_out_pp);
    }
  }

  /* Configure CTS pin regarding Flow control configuration */
  if (usart->io.cts) {
    if ((flow_control == USART_FLOW_CONTROL_CTS) || (flow_control == USART_FLOW_CONTROL_RTS_CTS)) {
      /* USART CTS Alternate function */
      PinConfig(usart->io.cts, &USART_pin_cfg_af);
    }
    else {
      /* GPIO input */
      PinConfig(usart->io.cts, &USART_pin_cfg_input);
    }
  }

  /* Configure USART control registers */
  reg->CR1 = cr1;
  reg->CR2 = cr2;
  reg->CR3 = cr3;

  /* USART Enable */
  reg->CR1 |= USART_CR1_UE;

  /* Set configured flag */
  info->flags |= USART_FLAG_CONFIGURED;

  return (DRIVER_OK);
}

/**
 * @fn          USART_STATUS USART_GetStatus(const USART_RESOURCES *usart)
 * @brief       Get USART status.
 * @param[in]   usart     Pointer to USART resources
 * @return      USART status \ref USART_STATUS
 */
static
USART_STATUS USART_GetStatus(const USART_RESOURCES *usart)
{
  USART_STATUS status;

