koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.c
  /* Framing error */
  if ((sr & USART_ISR_FE) != 0U) {
    /* clear the FE flag */
    reg->ICR = USART_ICR_FECF;
    info->status.rx_framing_error = 1U;
    event |= USART_EVENT_RX_FRAMING_ERROR;
  }

  /* Parity error */
  if ((sr & USART_ISR_PE) != 0U) {
    /* Clear the PE flag */
    reg->ICR = USART_ICR_PECF;
    info->status.rx_parity_error = 1U;
    event |= USART_EVENT_RX_PARITY_ERROR;
  }

  /* Noise Detection */
  if ((sr & USART_ISR_NE) != 0U) {
    /* Clear Noise detection flag */
    reg->ICR = USART_ICR_NCF;
  }

  /* Break Detection */
  if ((sr & USART_ISR_LBDF) != 0U) {
    /* Clear Break detection flag */
    reg->ICR = USART_ICR_LBDCF;
    info->status.rx_break = 1U;
    event |= USART_EVENT_RX_BREAK;
  }

  /* CTS changed */
  if ((sr & USART_ISR_CTSIF) != 0U) {
    /* Clear CTS flag */
    reg->ICR = USART_ICR_CTSCF;
    event |= USART_EVENT_CTS;
  }

  /* Send Event */
  if ((event && info->cb_event) != 0U) {
    info->cb_event(event);
  }
}

#ifdef __USART_DMA_TX
static void USART_TX_DMA_Callback(uint32_t event, const void *param)
{
  const USART_RESOURCES *usart = param;
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if (event & DMA_EVENT_TRANSFER_COMPLETE) {
    xfer->tx_cnt = xfer->tx_num;
    /* Clear TX busy flag */
    xfer->send_active = 0U;

    /* TC interrupt enable */
    usart->reg->CR1 |= USART_CR1_TCIE;

    /* Set Send Complete event for asynchronous transfers */
    if (info->mode != USART_MODE_SYNCHRONOUS_MASTER) {
      if (info->cb_event) {
        info->cb_event(USART_EVENT_SEND_COMPLETE);
      }
    }
  }
}
#endif

#ifdef __USART_DMA_RX
static void USART_RX_DMA_Callback(uint32_t event, const void *param)
{
  const USART_RESOURCES *usart = param;
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  uint32_t val, cb_event;

  if (event & DMA_EVENT_TRANSFER_COMPLETE) {
    /* Disable IDLE interrupt */
    usart->reg->CR1 &= ~USART_CR1_IDLEIE;

    cb_event = 0U;

    if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
      val = xfer->sync_mode;
      xfer->sync_mode = 0U;
      switch (val) {
        case USART_SYNC_MODE_TX:
          cb_event = USART_EVENT_SEND_COMPLETE;
          break;
        case USART_SYNC_MODE_RX:
          cb_event = USART_EVENT_RECEIVE_COMPLETE;
          break;
        case USART_SYNC_MODE_TX_RX:
          cb_event = USART_EVENT_TRANSFER_COMPLETE;
          break;
        default:
          break;
      }
    }
    else {
      cb_event = USART_EVENT_RECEIVE_COMPLETE;
    }

    xfer->rx_cnt = xfer->rx_num;
    info->status.rx_busy = 0U;

    /* Enable RXNE interrupt to detect RX overrun */
    usart->reg->CR1 |= USART_CR1_RXNEIE;

    if (info->cb_event && cb_event) {
      info->cb_event(cb_event);
    }
  }
}
#endif

#ifdef USE_USART1
  USARTx_EXPORT_DRIVER(1);
#endif  /* USE_USART1 */

#ifdef USE_USART2
  USARTx_EXPORT_DRIVER(2);
#endif  /* USE_USART2 */

#ifdef USE_USART3
  USARTx_EXPORT_DRIVER(3);
#endif  /* USE_USART3 */

#ifdef USE_UART4
  UARTx_EXPORT_DRIVER(4);
#endif  /* USE_UART4 */

#ifdef USE_UART5
  UARTx_EXPORT_DRIVER(5);
#endif  /* USE_UART5 */

#ifdef USE_USART6
  USARTx_EXPORT_DRIVER(6);
#endif  /* USE_USART6 */

#ifdef USE_UART7
  UARTx_EXPORT_DRIVER(7);
#endif  /* USE_UART7 */

#ifdef USE_UART8
  UARTx_EXPORT_DRIVER(8);
#endif  /* USE_UART8 */

#endif

/* ----------------------------- End of file ---------------------------------*/
